In [1]:
import pandas as pd

In [10]:
df = pd.DataFrame()
data = {
    'Name': ['Gurjot','Harsh','Moksh','Pratham','Navya','Mohit','Lovish','Mama','Fufad','Lovisha'],
    'Gender': ['M','M','M','M','F','M','M','M','M','F'],
    'age': [1,2,3,4,5,6,7,8,9,10],
    'address': ['abc','def','gh','ij','kl','mno','pq','rst','uvw','xyz']
}

df = pd.DataFrame(data)
print(df)

      Name Gender  age address
0   Gurjot      M    1     abc
1    Harsh      M    2     def
2    Moksh      M    3      gh
3  Pratham      M    4      ij
4    Navya      F    5      kl
5    Mohit      M    6     mno
6   Lovish      M    7      pq
7     Mama      M    8     rst
8    Fufad      M    9     uvw
9  Lovisha      F   10     xyz

In [4]:
df.iloc[4]

Name       Navya
Gender         F
age            5
address       kl
Name: 4, dtype: object

In [5]:
df.iloc[1:4]

      Name Gender  age address
1    Harsh      M    2     def
2    Moksh      M    3      gh
3  Pratham      M    4      ij

In [6]:
df.iloc[:]

      Name Gender  age address
0   Gurjot      M    1     abc
1    Harsh      M    2     def
2    Moksh      M    3      gh
3  Pratham      M    4      ij
4    Navya      F    5      kl
5    Mohit      M    6     mno
6   Lovish      M    7      pq
7     Mama      M    8     rst
8    Fufad      M    9     uvw
9  Lovisha      F   10     xyz

In [7]:
df.iloc[1:4,5:8]

Empty DataFrame
Columns: []
Index: [1, 2, 3]

In [9]:
df[df['Gender']=='F']

      Name Gender  age address
4    Navya      F    5      kl
9  Lovisha      F   10     xyz

In [12]:
df['Gender'].replace(['F'],['woman'])

0        M
1        M
2        M
3        M
4    woman
5        M
6        M
7        M
8        M
9    woman
Name: Gender, dtype: object

In [21]:
df.rename(columns={'address':'ghar ka pata'})

      Name Gender  age ghar ka pata
0   Gurjot      M    1          abc
1    Harsh      M    2          def
2    Moksh      M    3           gh
3  Pratham      M    4           ij
4    Navya      F    5           kl
5    Mohit      M    6          mno
6   Lovish      M    7           pq
7     Mama      M    8          rst
8    Fufad      M    9          uvw
9  Lovisha      F   10          xyz

In [23]:
 print(df['age'].max())

10

In [24]:
 print(df['age'].min())

1

In [25]:
 print(df['age'].sum())

55

In [26]:
 print(df['age'].mean())

5.5

In [27]:
 print(df['age'].count())

10

In [28]:
 print(df['Gender'].unique())

['M' 'F']

In [29]:
 print(df['Gender'].nunique())

2

In [30]:
print(df['age'].value_counts())

age
1     1
2     1
3     1
4     1
5     1
6     1
7     1
8     1
9     1
10    1
Name: count, dtype: int64

In [31]:
print(df['Gender'].value_counts())

Gender
M    8
F    2
Name: count, dtype: int64

In [33]:
df.drop(['age'],axis=1) ##col

      Name Gender ghar ka pata
0   Gurjot      M          abc
1    Harsh      M          def
2    Moksh      M           gh
3  Pratham      M           ij
4    Navya      F           kl
5    Mohit      M          mno
6   Lovish      M           pq
7     Mama      M          rst
8    Fufad      M          uvw
9  Lovisha      F          xyz